[Killed] Block
express-boilerplate/src/middleware/authMiddleware.js:3:42
 var parse = require('../utils/jwt.js')
 
-var authMiddleware = (req, res, next) => {
-  var jwt = req.get('Authorization')
-  if (!jwt) return next()
-  req.user = parse(jwt)
-  next()
-}
+var authMiddleware = (req, res, next) => {}
 
 module.exports = authMiddleware

[Survived] IfStatement
express-boilerplate/src/middleware/authMiddleware.js:5:7
 
 var authMiddleware = (req, res, next) => {
   var jwt = req.get('Authorization')
-  if (!jwt) return next()
+  if (false) return next()
   req.user = parse(jwt)
   next()

[Survived] PrefixUnaryExpression
express-boilerplate/src/middleware/authMiddleware.js:5:7
 
 var authMiddleware = (req, res, next) => {
   var jwt = req.get('Authorization')
-  if (!jwt) return next()
+  if (jwt) return next()
   req.user = parse(jwt)
   next()
