[Survived] StringLiteral
jslibs/express-boilerplate/src/app.js:18:16
 
 app.use(bodyParser.json())
 app.use(cookieParser())
-app.use(logger('combined'))
+app.use(logger(""))
 
 app.use(authMiddleware)
