[Survived] Block
express-boilerplate/src/middleware/errorHandler.js:1:54
-var errorHandler = (app) => (err, req, res, next) => {
-  res.status(err.status || 500)
-  res.json({
-    message: err.message,
-    error: app.get('env') === 'development' ? err : {},
-  })
-}
+var errorHandler = (app) => (err, req, res, next) => {}
 
 module.exports = errorHandler

[NoCoverage] BinaryExpression
express-boilerplate/src/middleware/errorHandler.js:2:14
 var errorHandler = (app) => (err, req, res, next) => {
-  res.status(err.status || 500)
+  res.status(err.status && 500)
   res.json({
     message: err.message,

[NoCoverage] ConditionalExpression
express-boilerplate/src/middleware/errorHandler.js:2:14
 var errorHandler = (app) => (err, req, res, next) => {
-  res.status(err.status || 500)
+  res.status(true)
   res.json({
     message: err.message,

[NoCoverage] BinaryExpression
express-boilerplate/src/middleware/errorHandler.js:5:12
   res.status(err.status || 500)
   res.json({
     message: err.message,
-    error: app.get('env') === 'development' ? err : {},
+    error: app.get('env') !== 'development' ? err : {},
   })
 }

[NoCoverage] ConditionalExpression
express-boilerplate/src/middleware/errorHandler.js:5:12
   res.status(err.status || 500)
   res.json({
     message: err.message,
-    error: app.get('env') === 'development' ? err : {},
+    error: true ? err : {},
   })
 }
