[Survived] Block
express-boilerplate/src/utils/jwt.js:1:29
-module.exports = (token) => {
-  try {
-    return JSON.parse(Buffer.from(token.split('.')[1], 'base64').toString())
-  } catch (e) {
-    return null
-  }
-}
+module.exports = (token) => {}
 

[NoCoverage] Block
express-boilerplate/src/utils/jwt.js:2:7
 module.exports = (token) => {
-  try {
-    return JSON.parse(Buffer.from(token.split('.')[1], 'base64').toString())
-  } catch (e) {
+  try {} catch (e) {
     return null
   }

[NoCoverage] StringLiteral
express-boilerplate/src/utils/jwt.js:3:47
 module.exports = (token) => {
   try {
-    return JSON.parse(Buffer.from(token.split('.')[1], 'base64').toString())
+    return JSON.parse(Buffer.from(token.split("")[1], 'base64').toString())
   } catch (e) {
     return null

[NoCoverage] Block
express-boilerplate/src/utils/jwt.js:4:15
 module.exports = (token) => {
   try {
     return JSON.parse(Buffer.from(token.split('.')[1], 'base64').toString())
-  } catch (e) {
-    return null
-  }
+  } catch (e) {}
 }
 
