[NoCoverage] StringLiteral
src/models/dto/user.js:1:22
-var mapper = require('object-mapper')
+var mapper = require("")
 
 var userDto = (user) =>

[NoCoverage] BooleanSubstitution
src/models/dto/user.js:4:28
 var mapper = require('object-mapper')
 
 var userDto = (user) =>
-  mapper(user.get({ plain: true }), {
+  mapper(user.get({ plain: false }), {
     username: 'username',
   })

[NoCoverage] BooleanSubstitution
src/models/dto/user.js:9:28
   })
 
 var extendedUserDto = (user) =>
-  mapper(user.get({ plain: true }), {
+  mapper(user.get({ plain: false }), {
     id: 'id',
     username: 'username',

[NoCoverage] ObjectLiteral
src/models/dto/user.js:9:37
   })
 
 var extendedUserDto = (user) =>
-  mapper(user.get({ plain: true }), {
-    id: 'id',
-    username: 'username',
-  })
+  mapper(user.get({ plain: true }), {})
 
 module.exports = {

[NoCoverage] StringLiteral
src/models/dto/user.js:11:15
 var extendedUserDto = (user) =>
   mapper(user.get({ plain: true }), {
     id: 'id',
-    username: 'username',
+    username: "",
   })
 

[NoCoverage] ObjectLiteral
src/models/dto/user.js:14:18
     username: 'username',
   })
 
-module.exports = {
-  userDto,
-  extendedUserDto,
-}
+module.exports = {}
 
