[Survived] Block
src/models/entity/task.js:7:32
     title: DataTypes.STRING,
   })
 
-  Task.associate = (models) => {
-    models.Task.belongsTo(models.User, {
-      onDelete: 'CASCADE',
-      foreignKey: {
-        allowNull: false,
-      },
-    })
-  }
+  Task.associate = (models) => {}
 
   return Task

[Survived] StringLiteral
src/models/entity/task.js:9:17
 
   Task.associate = (models) => {
     models.Task.belongsTo(models.User, {
-      onDelete: 'CASCADE',
+      onDelete: "",
       foreignKey: {
         allowNull: false,

[Survived] ObjectLiteral
src/models/entity/task.js:10:19
   Task.associate = (models) => {
     models.Task.belongsTo(models.User, {
       onDelete: 'CASCADE',
-      foreignKey: {
-        allowNull: false,
-      },
+      foreignKey: {},
     })
   }

[Survived] BooleanSubstitution
src/models/entity/task.js:11:20
     models.Task.belongsTo(models.User, {
       onDelete: 'CASCADE',
       foreignKey: {
-        allowNull: false,
+        allowNull: true,
       },
     })
