[Survived] Block
src/models/entity/user.js:7:32
     username: DataTypes.STRING,
   })
 
-  User.associate = (models) => {
-    models.User.hasMany(models.Task)
-  }
+  User.associate = (models) => {}
 
   return User
