[Killed] BinaryExpression
express-boilerplate/src/models/index.js:7:11
 var path = require('path')
 var Sequelize = require('sequelize')
 var basename = path.basename(__filename)
-var env = process.env.NODE_ENV || 'development'
+var env = process.env.NODE_ENV && 'development'
 var config = require(__dirname + '/../../config.js')[env]
 var db = {}

[Survived] StringLiteral
express-boilerplate/src/models/index.js:7:35
 var path = require('path')
 var Sequelize = require('sequelize')
 var basename = path.basename(__filename)
-var env = process.env.NODE_ENV || 'development'
+var env = process.env.NODE_ENV || ""
 var config = require(__dirname + '/../../config.js')[env]
 var db = {}

[Survived] Block
express-boilerplate/src/models/index.js:11:30
 var config = require(__dirname + '/../../config.js')[env]
 var db = {}
 
-if (config.use_env_variable) {
-  var sequelize = new Sequelize(process.env[config.use_env_variable], config)
-} else {
+if (config.use_env_variable) {} else {
   var sequelize = new Sequelize(
     config.database,

[Survived] IfStatement
express-boilerplate/src/models/index.js:11:5
 var config = require(__dirname + '/../../config.js')[env]
 var db = {}
 
-if (config.use_env_variable) {
+if (false) {
   var sequelize = new Sequelize(process.env[config.use_env_variable], config)
 } else {

[Killed] Block
express-boilerplate/src/models/index.js:23:21
 }
 
 fs.readdirSync(__dirname + '/entity')
-  .filter((file) => {
-    return (
-      file.indexOf('.') !== 0 && file !== basename && file.slice(-3) === '.js'
-    )
-  })
+  .filter((file) => {})
   .forEach((file) => {
     var model = sequelize['import'](path.join(__dirname + '/entity', file))

[Killed] BinaryExpression
express-boilerplate/src/models/index.js:25:34
 fs.readdirSync(__dirname + '/entity')
   .filter((file) => {
     return (
-      file.indexOf('.') !== 0 && file !== basename && file.slice(-3) === '.js'
+      file.indexOf('.') !== 0 && file === basename && file.slice(-3) === '.js'
     )
   })

[Killed] ConditionalExpression
express-boilerplate/src/models/index.js:25:34
 fs.readdirSync(__dirname + '/entity')
   .filter((file) => {
     return (
-      file.indexOf('.') !== 0 && file !== basename && file.slice(-3) === '.js'
+      file.indexOf('.') !== 0 && false && file.slice(-3) === '.js'
     )
   })

[Killed] Block
express-boilerplate/src/models/index.js:28:22
       file.indexOf('.') !== 0 && file !== basename && file.slice(-3) === '.js'
     )
   })
-  .forEach((file) => {
-    var model = sequelize['import'](path.join(__dirname + '/entity', file))
-    db[model.name] = model
-  })
+  .forEach((file) => {})
 
 Object.keys(db).forEach((modelName) => {

[Survived] Block
express-boilerplate/src/models/index.js:33:40
     db[model.name] = model
   })
 
-Object.keys(db).forEach((modelName) => {
-  if (db[modelName].associate) {
-    db[modelName].associate(db)
-  }
-})
+Object.keys(db).forEach((modelName) => {})
 
 db.sequelize = sequelize

[Survived] IfStatement
express-boilerplate/src/models/index.js:34:7
   })
 
 Object.keys(db).forEach((modelName) => {
-  if (db[modelName].associate) {
+  if (false) {
     db[modelName].associate(db)
   }

[Survived] IfStatement
express-boilerplate/src/models/index.js:34:7
   })
 
 Object.keys(db).forEach((modelName) => {
-  if (db[modelName].associate) {
+  if (true) {
     db[modelName].associate(db)
   }
