[Survived] Block
express-boilerplate/src/routes/tasks.js:5:43
 var express = require('express')
 var router = express.Router()
 
-router.post('/tasks', async (req, res) => {
-  let newTask = {
-    title: req.body.title,
-    UserId: req.query.user_id,
-  }
-  let savedTask = await models.Task.create(newTask)
-  res.json(taskDto(savedTask))
-})
+router.post('/tasks', async (req, res) => {})
 
 router.delete('tasks/:task_id', async (req, res) => {

[NoCoverage] ObjectLiteral
express-boilerplate/src/routes/tasks.js:6:17
 var router = express.Router()
 
 router.post('/tasks', async (req, res) => {
-  let newTask = {
-    title: req.body.title,
-    UserId: req.query.user_id,
-  }
+  let newTask = {}
   let savedTask = await models.Task.create(newTask)
   res.json(taskDto(savedTask))

[Survived] Block
express-boilerplate/src/routes/tasks.js:14:53
   res.json(taskDto(savedTask))
 })
 
-router.delete('tasks/:task_id', async (req, res) => {
-  let criteria = {
-    where: {
-      id: req.params.task_id,
-    },
-  }
-  await models.Task.destroy(criteria)
-  res.status(201).end()
-})
+router.delete('tasks/:task_id', async (req, res) => {})
 
 module.exports = router
