[Killed] Block
express-boilerplate/src/routes/users.js:5:37
 var express = require('express')
 var router = express.Router()
 
-router.get('/', async (req, res) => {
-  let users = await models.User.findAll()
-  res.json({ users })
-})
+router.get('/', async (req, res) => {})
 
 router.get('/:user_id', async (req, res) => {

[Survived] Block
express-boilerplate/src/routes/users.js:10:45
   res.json({ users })
 })
 
-router.get('/:user_id', async (req, res) => {
-  let criteria = {
-    where: {
-      id: user_id
-    }
-  }
-  let user = await models.User.findAll(criteria)
-  res.json(user)
-})
+router.get('/:user_id', async (req, res) => {})
 
 router.post('/', async (req, res) => {

[Killed] Block
express-boilerplate/src/routes/users.js:20:38
   res.json(user)
 })
 
-router.post('/', async (req, res) => {
-  let newUser = {
-    username: req.body.username,
-  }
-  let savedUser = await models.User.create(newUser)
-  res.json(savedUser)
-})
+router.post('/', async (req, res) => {})
 
 router.put('/:user_id', async (req, res) => {

[Survived] StringLiteral
express-boilerplate/src/routes/users.js:20:13
   res.json(user)
 })
 
-router.post('/', async (req, res) => {
+router.post("", async (req, res) => {
   let newUser = {
     username: req.body.username,

[Killed] Block
express-boilerplate/src/routes/users.js:28:45
   res.json(savedUser)
 })
 
-router.put('/:user_id', async (req, res) => {
-  let criteria = {
-    where: {
-      id: req.params.user_id
-    }
-  }
-  let data = {
-    username: req.body.username
-  }
-  let savedUser = await models.User.update(data, criteria)
-  res.json(savedUser)
-})
+router.put('/:user_id', async (req, res) => {})
 
 router.delete('/:user_id', async (req, res) => {

[Killed] StringLiteral
express-boilerplate/src/routes/users.js:28:12
   res.json(savedUser)
 })
 
-router.put('/:user_id', async (req, res) => {
+router.put("", async (req, res) => {
   let criteria = {
     where: {

[Survived] Block
express-boilerplate/src/routes/users.js:41:48
   res.json(savedUser)
 })
 
-router.delete('/:user_id', async (req, res) => {
-  let criteria = {
-    where: {
-      id: req.params.user_id,
-    },
-  }
-  await models.User.destroy(criteria)
-  res.status(201).end()
-})
+router.delete('/:user_id', async (req, res) => {})
 
 module.exports = router

[NoCoverage] ObjectLiteral
express-boilerplate/src/routes/users.js:42:18
 })
 
 router.delete('/:user_id', async (req, res) => {
-  let criteria = {
-    where: {
-      id: req.params.user_id,
-    },
-  }
+  let criteria = {}
   await models.User.destroy(criteria)
   res.status(201).end()
